Revit 2026 API

# DWFImportOptions(DWFImportOptions) Constructor

---

Constructs a new instance of DWFImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DWFImportOptions(
	DWFImportOptions option
)
```
```vb
Public Sub New (
	option As DWFImportOptions
)
```
```cpp
public:
DWFImportOptions(
	DWFImportOptions^ option
)
```
```fsharp
new :
        option : DWFImportOptions -> DWFImportOptions
```

#### Parameters

option DWFImportOptions
     The options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DWFImportOptions Class

DWFImportOptions Overload

Autodesk.Revit.DB Namespace